PROJECTS_LIST_PAGINATION = 10
BLOG_LIST_PAGINATION = 5

MAIN_GALLERY_LIMIT = 10
LATEST_NEWS_LIMIT = 3

SPAM_PATTERNS_DATA = (
    r'\b(?:казино|бонусы в казино|бесплатные фишки|слот|рулетка|выигрыш|джекпот|'
    r':игра на деньги|азартные игры|онлайн казино|игровые автоматы|букмекерская контора|'
    r'ставки на спорт|покер|блэкджек|ставка|deposit|bonus|игровые автоматы|'
    r'фрибет|casino|займ|порно|эротика|секс|интим|взрослые сайты|порноролики|'
    r'порностудия|видеочат 18+|порнофильмы|xxx|18+|эротическое видео|секс-чат|'
    r'секс-знакомства|порноактриса|быстрый заработок|легкие деньги|финансовая пирамида|'
    r'инвестиции с высоким доходом|получить деньги|быстрый займ|выигрыш в лотерею|выиграй|'
    r'легальный заработок|онлайн заработок|без вложений|доход без риска|криптовалюта|'
    r'бинарные опционы|форекс|деньгилекарства без рецепта|виагра|увеличение груди|'
    r'пластическая хирургия|лечение без врачей|волшебные таблетки|чудо-препарат|увеличение потенции|'
    r'средство для похудения|быстрое похудение|таблетки для похудения|очищение организма|'
    r'народные средства|лечение в домашних условиях|бады|adult|viagra|ссылка на сайт|'
    r'кликните здесь|перейдите по ссылке|уникальное предложение|бесплатный доступ|увеличить член|'
    r'форум|комментарии|поддельные отзывы|накрутка подписчиков|накрутка лайков|продвижение в соцсетях|'
    r'seo-услуги|зеркало|официальный сайт|online|рабочее зеркало)\b|'
    r'<script\b[^>]*>|<iframe\b[^>]*>|<img\b[^>]*src\b[^>]*>|<a\b[^>]*href\b[^>]*>|'
    r'<embed\b[^>]*>|<object\b[^>]*>|<form\b[^>]*>|<style\b[^>]*>|[$#&]'
)
